In [1]:
# Import Libraries and Dependencies
import pandas as pd

In [2]:
import os
print(os.getcwd())

C:\Users\larav\OneDrive\Desktop\Challenge Repo\athletic_sales_analysis\Starter_Code

### 1. Combine and Clean the Data
#### Import CSVs

In [4]:
# Read the CSV files into DataFrames.
df_2020 = pd.read_csv('/Users/larav/OneDrive/Desktop/Challenge Repo/athletic_sales_analysis/Starter_Code/Resources/athletic_sales_2020.csv')
df_2021 = pd.read_csv('/Users/larav/OneDrive/Desktop/Challenge Repo/athletic_sales_analysis/Starter_Code/Resources/athletic_sales_2021.csv')

In [5]:
# Display the 2020 sales DataFrame
print("2020 Sales DataFrame:")
df_2020.head()

2020 Sales DataFrame:

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [6]:
# Display the 2021 sales DataFrame
print("\n2021 Sales DataFrame:")
df_2021.head()

2021 Sales DataFrame:

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [8]:
# Check the 2020 sales data types.
print("\n2020 Sales Data Types:")
df_2020.dtypes

2020 Sales Data Types:

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [9]:
# Check the 2021 sales data types.
print("\n2021 Sales Data Types:")
df_2021.dtypes

2021 Sales Data Types:

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [11]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_df = pd.concat([df_2020, df_2021], ignore_index=True)

In [12]:
# Check if any values are null.
print("\nNull Values in Combined DataFrame:")
combined_df.isnull().sum()

Null Values in Combined DataFrame:

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [13]:
# Check the data type of each column
print("\nData Types in Combined DataFrame:")
combined_df.dtypes

Data Types in Combined DataFrame:

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [14]:
# Convert the "invoice_date" to a datetime datatype
combined_df['invoice_date'] = pd.to_datetime(combined_df['invoice_date'])

C:\Users\larav\AppData\Local\Temp\ipykernel_12060\4103426645.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_df['invoice_date'] = pd.to_datetime(combined_df['invoice_date'])

In [15]:
# Confirm that the "invoice_date" data type has been changed.
print("\nData Type of 'invoice_date' after conversion:")
combined_df['invoice_date'].dtypes

Data Type of 'invoice_date' after conversion:

dtype('<M8[ns]')

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [18]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
region_sales = combined_df.groupby(['region', 'state', 'city'])['units_sold'].sum()
region_sales = region_sales.rename("Total_Products_Sold")


# Show the top 5 results.
top_region_sales = region_sales.sort_values(ascending=False).head(5)
print("\nTop 5 Regions by Total Products Sold:")
top_region_sales

Top 5 Regions by Total Products Sold:

region     state       city
Northeast  New York    New York         111954
South      Texas       Houston           90322
West       California  San Francisco     85478
                       Los Angeles       76384
Southeast  Florida     Miami             73135
Name: Total_Products_Sold, dtype: int64

#### Using `pivot_table`

In [20]:
# Show the number products sold for region, state, and city.
region_pivot_sales = combined_df.pivot_table(index=['region', 'state', 'city'], values='units_sold', aggfunc='sum')

# Rename the "units_sold" column to "Total_Products_Sold"
region_pivot_sales.rename(columns={'units_sold': 'Total_Products_Sold'}, inplace=True)

# Show the top 5 results.
top_region_pivot_sales = region_pivot_sales.sort_values(by='Total_Products_Sold', ascending=False).head(5)
print("\nTop 5 Regions by Total Products Sold (using Pivot Table):")
top_region_pivot_sales

Top 5 Regions by Total Products Sold (using Pivot Table):

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [23]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
region_sales_totals = combined_df.groupby(['region', 'state', 'city'])['total_sales'].sum().reset_index()
region_sales_totals.rename(columns={'total_sales': 'Total Sales'}, inplace=True)
# Show the top 5 results.
top_region_sales_totals = region_sales_totals.sort_values(by='Total Sales', ascending=False).head(5)
print("\nTop 5 Regions by Total Sales:")
top_region_sales_totals

Top 5 Regions by Total Sales:

       region           state           city  Total Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

#### Using `pivot_table`

In [25]:
# Show the total sales for the products sold for each region, state, and city.
region_pivot_sales_totals = combined_df.pivot_table(index=['region', 'state', 'city'], values='total_sales', aggfunc='sum')


# Optional: Rename the "total_sales" column to "Total Sales"
region_pivot_sales_totals.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the top 5 results.
top_region_pivot_sales_totals = region_pivot_sales_totals.sort_values(by='Total Sales', ascending=False).head(5)
print("\nTop 5 Regions by Total Sales (using Pivot Table):")
top_region_pivot_sales_totals

Top 5 Regions by Total Sales (using Pivot Table):

                                        Total Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [28]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
retailer_sales = combined_df.groupby(['retailer', 'region', 'state', 'city'])['total_sales'].sum().reset_index()
retailer_sales.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the top 5 results.
top_retailer_sales = retailer_sales.sort_values(by='Total Sales', ascending=False).head(5)
print("\nTop 5 Retailers by Total Sales:")
top_retailer_sales

Top 5 Retailers by Total Sales:

        retailer     region           state           city  Total Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

#### Using `pivot_table`

In [30]:
# Show the total sales for the products sold for each retailer, region, state, and city.
retailer_pivot_sales = combined_df.pivot_table(index=['retailer', 'region', 'state', 'city'], values='total_sales', aggfunc='sum')


# Optional: Rename the "total_sales" column to "Total Sales"
retailer_pivot_sales.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the top 5 results.
top_retailer_pivot_sales = retailer_pivot_sales.sort_values(by='Total Sales', ascending=False).head(5)
print("\nTop 5 Retailers by Total Sales (using Pivot Table):")
top_retailer_pivot_sales

Top 5 Retailers by Total Sales (using Pivot Table):

                                                    Total Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [32]:
# Filter the sales data to get the women's athletic footwear sales data.
women_footwear_sales = combined_df[combined_df['product'] == "Women's Athletic Footwear"]
women_footwear_sales

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
9633,Foot Locker,1185732,2021-12-30,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,57,53,3021,1601.13,Online
9634,Foot Locker,1185732,2021-12-30,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,40,53,2120,954.00,Outlet
9635,Amazon,1185732,2021-12-30,Northeast,Maine,Portland,Women's Athletic Footwear,42,36,1512,680.40,Online
9636,Amazon,1185732,2021-12-30,Northeast,Maine,Portland,Women's Athletic Footwear,45,125,56250,16875.00,Outlet
9637,Foot Locker,1185732,2021-12-30,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,60,175,105000,42000.00,Outlet

#### Using `groupby`

In [34]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
women_footwear_sales_grouped = women_footwear_sales.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].sum().reset_index()
women_footwear_sales_grouped.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace=True)


# Show the top 5 results.
top_women_footwear_sales = women_footwear_sales_grouped.sort_values(by='Womens_Footwear_Units_Sold', ascending=False).head(5)
print("\nTop 5 Retailers by Women's Athletic Footwear Units Sold:")
top_women_footwear_sales

Top 5 Retailers by Women's Athletic Footwear Units Sold:

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

#### Using `pivot_table`

In [36]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
women_footwear_sales_pivot = women_footwear_sales.pivot_table(index=['retailer', 'region', 'state', 'city'], values='units_sold', aggfunc='sum')


# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
women_footwear_sales_pivot.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace=True)


# Show the top 5 results.
women_footwear_sales_pivot.sort_values(by='Womens_Footwear_Units_Sold', ascending=False).head(5)

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

In [38]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
women_footwear_daily = women_footwear_sales.pivot_table(index='invoice_date', values='total_sales', aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
women_footwear_daily.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the table.
print("\nWomen’s Athletic Footwear Sales by Day:")
women_footwear_daily.head()

Women’s Athletic Footwear Sales by Day:

              Total Sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-11         129556
2020-01-17         173013
2020-01-22         388250

In [39]:
# Resample the pivot table into daily bins, and get the total sales for each day.
daily_sales_resampled = women_footwear_daily.resample('D').sum()


# Sort the resampled pivot table in descending order on "Total Sales".
top_daily_sales = daily_sales_resampled.sort_values(by='Total Sales', ascending=False)
print("\nTop Daily Sales of Women’s Athletic Footwear:")
top_daily_sales.head(10)

Top Daily Sales of Women’s Athletic Footwear:

              Total Sales
invoice_date
2021-07-16        1521825
2021-12-16        1473497
2021-06-17        1376988
2021-08-17        1086294
2021-07-23        1021806
2021-11-17        1021145
2021-12-09         915011
2021-06-24         884238
2021-07-09         869054
2021-08-10         839120

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

In [41]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
weekly_sales_resampled = daily_sales_resampled.resample('W').sum()


# Sort the resampled pivot table in descending order on "Total Sales".
top_weekly_sales = weekly_sales_resampled.sort_values(by='Total Sales', ascending=False)
print("\nTop Weekly Sales of Women’s Athletic Footwear:")
top_weekly_sales.head(10)

Top Weekly Sales of Women’s Athletic Footwear:

              Total Sales
invoice_date
2021-12-19        3098970
2021-12-12        2922161
2021-07-11        2835078
2021-07-18        2801449
2021-11-14        2531721
2021-08-22        2491259
2021-08-15        2463941
2021-11-21        2449537
2021-05-16        2422132
2021-06-13        2358602